---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurfaceError
source: html/740c1118-8008-512f-2de7-8bc0d4ad79e2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurfaceError Property

Can't construct surface.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeSurfaceError { get; }
```